import os

message_welcome = '''Добро пожаловать, этот бот поможет сгенерировать изображения с помощью нейросети'''
message_accouunt = '''👨‍💻 {}
▪️ Ваш ID {}
▪️ Токенов: {}
'''
message_draw = '''Отправьте боту описание картинки'''
message_result = '''☑️ Вот ваш результат:'''
message_rate= '''Выберите свою оценку'''
message_drawFinished = '''Вот ваш результат'''
message_info = '''👨‍💻 Модераторы: '''
message_pay = '''▪️ Оплатите доступ по ссылке и нажмите подтверить

▪️ {}
'''
message_payFinised = '✅ Токены успешно зачислены на ваш аккаунт!'
message_toCheckOut = 'У вам закончились токены. Перейти к покупке?'

image_course = os.getcwd() + '/bot/app/assets/Asset.png'

button_back = '🔙 Назад'
button_cancel = '❌ Закрыть'
button_confirmPay = '✅ Оплачено'
button_rate = 'Оценить'
button_draw = 'Рисовать'
button_pay = 'Купить токены'
button_account = 'Мой аккаунт'
button_info = 'Поддержка'
button_infoAdmin = 'Админ: @test_udn7sQ_bot'

button_rate0 = '1️⃣'
button_rate1 = '️2️⃣'
button_rate2 = '3️⃣'
button_rate3 = '4️⃣'
button_rate4 = '5️⃣'

warning_finishRate = '''☑️
Спасибо за оценку!'''